Repository: zipf/perldoc-es
Catalog: memory/_reference/padre-es_work.tmx
Source language: en_us
Languages: es_es

source: Project-Id-Version: 0.69 Report-Msgid-Bugs-To: POT-Creation-Date: 2011-11-11 00:10-0800 PO-Revision-Date: 2010-12-04 16:23+0100 Last-Translator: Enrique Nell <blas.gordon@gmail.com> Language-Team: Spanish Language: MIME-Version: 1.0 Content-Type: text/plain; charset=UTF-8 Content-Transfer-Encoding: 8bit Plural-Forms: nplurals=2; plural=(n != 1); X-Poedit-Language: Spanish
es_es: Project-Id-Version: 0.93 Report-Msgid-Bugs-To: POT-Creation-Date: 2011-11-11 00:10-0800 PO-Revision-Date: 2010-12-04 16:23+0100 Last-Translator: Enrique Nell <blas.gordon@gmail.com> Language-Team: Spanish Language: MIME-Version: 1.0 Content-Type: text/plain; charset=UTF-8 Content-Transfer-Encoding: 8bit Plural-Forms: nplurals=2; plural=(n != 1); X-Poedit-Language: Spanish

source: "." also matches newline
es_es: "." también detecta una nueva línea

source: "Open session" will ask which session (set of files) to open when you launch Padre.
es_es: "Abrir sesión" preguntará qué sesión (conjunto de archivos) se desea abrir al iniciar Padre.

source: "Padre contains icons from GNOME, you can redistribute it and/or modify then under the terms of the GNU General Public License as published by the Free Software Foundation; version 2 dated June, 1991."
es_es: "Padre contiene iconos de GNOME. Puede redistribuirlo o modificarlo bajo los términos de la licencia GNU GPL (General Public License) versión 2, publicada por la Free Software Foundation en junio de 1991."

source: "Previous open files" will remember the open files when you close Padre and open the same files next time you launch Padre.
es_es: "Archivos abiertos en la sesión anterior" recordará los archivos que estaban abiertos al cerrar Padre y abrirá los mismos archivos la próxima vez que inicie Padre.

source: "^" and "$" match the start and end of any line inside the string
es_es: "^" y "$" encuentran el comienzo y el fin de cualquiera línea dentro de la cadena de texto

source: # Input is in $_ $_ = $_; # Output goes to $_
es_es: # La entrada está en $_ $_ = $_; # La salida va a $_

source: $_ for both
es_es: $_ para ambos

source: %d line added
es_es: %d línea agregada

source: %d line changed
es_es: %d línea modificada

source: %d line deleted
es_es: %d línea eliminada

source: %d lines added
es_es: %d líneas agregadas

source: %d lines changed
es_es: %d líneas modificadas

source: %d lines deleted
es_es: %d líneas eliminadas

source: %s (%s changed)
es_es: %s (%s modificados)

source: %s (%s results)
es_es: %s (%s resultados)

source: %s (crashed)
es_es: %s (bloqueado)

source: %s - Crashed while instantiating: %s
es_es: %s - Bloqueo al crear una instancia de %s

source: %s - Crashed while loading: %s
es_es: %s - Bloqueo al cargar %s

source: %s - Failed to instantiate plug-in
es_es: %s - No se pudo crear una instancia del complemento

source: %s - Not a Padre::Plugin subclass
es_es: %s - No es una subclase de Padre::Plugin

source: %s - Not compatible with Padre %s - %s
es_es: %s - No es compatible con Padre %s - %s

source: %s - Plugin is empty or unversioned
es_es: %s - El complemento está vacío o no hay control de versiones

source: %s in TODO regex, check your config.
es_es: %s en expresión regular de tareas pendientes; compruebe su configuración.

source: %s line %s: %s
es_es: %s línea %s: %s

source: %s version control is not currently available
es_es: El control de versiones de %s no está disponible actualmente

source: Line: %s File: %s - %s
es_es: Línea: %s Archivo: %s - %s

source: &About
es_es: &Acerca de

source: &Advanced...
es_es: &Avanzadas...

source: &Autocomplete
es_es: &Autocompletar

source: &Brace Matching
es_es: &Emparejamiento de llaves

source: &Browse
es_es: E&xaminar

source: &Cancel
es_es: &Cancelar

source: &Case Sensitive
es_es: &Distinguir mayúsculas de minúsculas

source: &Change variable style
es_es: &Cambiar estilo de variable

source: &Check for Common (Beginner) Errors
es_es: &Detectar errores comunes (de principiante)

source: &Clean Recent Files List
es_es: &Borrar lista de archivos recientes

source: &Clear Selection Marks
es_es: &Borrar marcas de selección

source: &Close
es_es: Ce&rrar

source: &Comment Out
es_es: Marcas como &comentario

source: &Context Help
es_es: Ayuda &contextual

source: &Context Menu
es_es: Menú &contextual

source: &Copy
es_es: &Copiar

source: &Debug
es_es: &Depurar

source: &Decrease Font Size
es_es: &Reducir tamaño de fuente

source: &Delete
es_es: Eli&minar

source: &Delete Trailing Spaces
es_es: Eliminar espacios &finales

source: &Deparse selection
es_es: Restaurar &selección a partir de análisis

source: &Disable
es_es: &Deshabilitar

source: &Document Statistics
es_es: Estadísticas del &documento

source: &Edit
es_es: Edi&tar

source: &Edit My Plug-in
es_es: &Editar complemento personalizado

source: &Edit with Regex Editor...
es_es: &Editar con el Editor de expresiones regulares

source: &Enable
es_es: &Habilitar

source: &Enter a line number between 1 and %s:
es_es: &Escriba un número de línea entre 1 y %s:

source: &Enter a position between 1 and %s:
es_es: Escri&ba una posición entre 1 y %s:

source: &File
es_es: &Archivo

source: &File...
es_es: Arch&hivo...

source: &Filter:
es_es: &Filtro:

source: &Find
es_es: &Buscar

source: &Find Previous
es_es: Buscar &anterior

source: &Find...
es_es: &Buscar...

source: &Fold All
es_es: &Plegar todo

source: &Fold/Unfold Current
es_es: Plegar/&Desplegar actual

source: &Go To...
es_es: &Ir a...

source: &Go to Element
es_es: Ir al &elemento

source: &Help
es_es: Ay&uda

source: &Increase Font Size
es_es: Aumentar tamaño de &fuente

source: &Install CPAN Module
es_es: &Instalar módulo de CPAN

source: &Join Lines
es_es: &Unir líneas

source: &Live Support
es_es: Soporte en &línea

source: &Load All Padre Modules
es_es: Cargar todos &los módulos de Padre

source: &Lower All
es_es: Convertir todo a &minúsculas

source: &Matching Help Topics:
es_es: Temas de ay&uda coincidentes

source: &Matching Items:
es_es: Ele&mentos coincidentes:

source: &Matching Menu Items:
es_es: Ele&mentos de menú coincidentes:

source: &Module Tools
es_es: Herramientas para &módulos

source: &Move POD to __END__
es_es: &Mover POD a __END__

source: &New
es_es: &Nuevo

source: &Newline Same Column
es_es: Carácter de nueva línea en la &misma columna

source: &Next
es_es: Siguie&nte

source: &Next Difference
es_es: Siguiente &diferencia

source: &Next File
es_es: Archivo &siguiente

source: &Next Problem
es_es: Pro&blema siguiente

source: &OK
es_es: &Aceptar

source: &Open
es_es: &Abrir

source: &Open All Recent Files
es_es: &Abrir todos los archivos recientes

source: &Open...
es_es: &Abrir...

source: &Original text:
es_es: Texto &original:

source: &Output text:
es_es: Text&o resultante:

source: &POSIX Character classes
es_es: Clases de caracteres &POSIX

source: &Padre Support (English)
es_es: Soporte técnico de &Padre (en inglés)

source: &Paste
es_es: &Pegar

source: &Patch...
es_es: &Aplicar revisión...

source: &Perl filter source:
es_es: Código fuente de filtro en &Perl:

source: &Plug-in Manager
es_es: Administrador de com&plementos

source: &Preferences
es_es: &Preferencias

source: &Previous File
es_es: Arc&hivo anterior

source: &Print...
es_es: I&mprimir...

source: &Quantifiers
es_es: Cuanti&ficadores

source: &Quick Fix
es_es: C&orrección rápida

source: &Quick Menu Access...
es_es: &Menú de acceso rápido...

source: &Quit
es_es: &Salir

source: &Recent Files
es_es: Archivos &recientes

source: &Redo
es_es: Re&hacer

source: &Regex Editor
es_es: Editor de expresiones &regulares

source: &Regular Expression
es_es: Expresión &regular

source: &Regular expression:
es_es: E&xpresión regular:

source: &Reload My Plug-in
es_es: Volve&r a cargar el complemento personalizado

source: &Reload selected
es_es: &Volver a cargar seleccionados

source: &Rename Variable...
es_es: Cambiar nombre de va&riable...

source: &Replace
es_es: &Reemplazar

source: &Replace text with:
es_es: Reempla&zar texto con:

source: &Replace...
es_es: &Reemplazar...

source: &Reset
es_es: &Volver a establecer

source: &Reset Font Size
es_es: &Restaurar tamaño de fuente

source: &Result from replace:
es_es: &Resultado de sustitución:

source: &Run
es_es: &Ejecutar

source: &Run Script
es_es: Ejecutar &script

source: &Save
es_es: &Guardar

source: &Save session automatically
es_es: &Guardar sesión automáticamente

source: &Scintilla Reference
es_es: Referencia de &Scintilla

source: &Search
es_es: &Buscar

source: &Search Help
es_es: &Buscar en la Ayuda

source: &Select
es_es: &Seleccionar

source: &Select an item to open (?
es_es: &Seleccionar un elemento para abrir (?

source: = any character, * = any string):
es_es: = cualquier carácter, * = cualquier cadena):

source: &Select files to reload:
es_es: &Seleccionar archivos para volver a cargar:

source: &Set
es_es: &Establecer

source: &Show error message
es_es: &Mostrar mensaje de error

source: &Snippets...
es_es: &Fragmentos de código...

source: &Start/Stop sub trace
es_es: Iniciar/detener &seguimiento de subrutina

source: &Stop Execution
es_es: &Detener ejecución

source: &Toggle Comment
es_es: Acti&var/desactivar marcas de comentario

source: &Tools
es_es: &Herramientas

source: &Translate Padre...
es_es: &Traducir Padre...

source: &Type a menu item name to access:
es_es: &Elemento de menú que desea seleccionar:

source: &Uncomment
es_es: &Quitar marca de comentario

source: &Undo
es_es: &Deshacer

source: &Update
es_es: Act&ualizar

source: &Upper All
es_es: Convertir todo a mayúsc&ulas

source: &Value:
es_es: &Valor:

source: &View
es_es: &Ver

source: &View Document As...
es_es: &Ver documento como...

source: &Win32 Questions (English)
es_es: Preguntas sobre &Win32 (en inglés)

source: &Window
es_es: Ve&ntana

source: &Word-Wrap File
es_es: Ajustar líneas de arc&hivo

source: &wxWidgets %s Reference
es_es: Referencia de &wxWidgets %s

source: '%s' does not look like a variable.
es_es: '%s' no parece una variable.

source: First select a variable in the code and then try again.
es_es: Seleccione una variable en el código e inténtelo de nuevo.

source: (Re)load &Current Plug-in
es_es: Volver a &cargar el complemento actual

source: (Since Perl %s)
es_es: (Desde Perl %s)

source: (Undefined)
es_es: (sin definir)

source: (core)
es_es: (básico)

source: (disabled)
es_es: (deshabilitado)

source: (unsupported)
es_es: (no se admite)

source: - DEPRECATED!
es_es: - OBSOLETO

source: 7-bit US-ASCII character
es_es: Carácter US-ASCII de 7 bits

source: <b>Loading %s...</b>
es_es: <b>Cargando %s...</b>

source: A Dialog
es_es: Un cuadro de diálogo

source: A comment
es_es: Un comentario

source: A group
es_es: Un grupo

source: A new empty file
es_es: Un archivo nuevo vacío

source: A set of unrelated tools used by the Padre developers
es_es: Diversas herramientas usadas por los programadores de Padre

source: A word boundary
es_es: Límite de palabra

source: About
es_es: Acerca de

source: Abstract
es_es: Resumen

source: Action
es_es: Acción

source: Action: %s
es_es: Acción: %s

source: Adam Kennedy: Chief Bugger
es_es: Adam Kennedy: Gran timonel

source: Add another closing bracket if there already is one
es_es: Agregar otra llave de cierre si ya hay una

source: Add file to repository?
es_es: ¿Desea agregar el archivo al repositorio?

source: Added
es_es: Agregado

source: Advanced Settings
es_es: Configuración avanzada

source: Against
es_es: En

source: Ahmad Zawawi: Developer
es_es: Ahmad Zawawi: Programador

source: Alarm
es_es: Alarma

source: Alien Error
es_es: Error externo

source: Align a selection of text to the same left column.
es_es: Alinea una selección de texto a la misma columna izquierda

source: All
es_es: Todo

source: All Files
es_es: Todos los archivos

source: All braces appear to be matched
es_es: Parece que no hay llaves desemparejadas

source: Allow the selection of another name to save the current document
es_es: Permite guardar el documento actual con otro nombre

source: Alphabetic characters
es_es: Caracteres alfabéticos

source: Alphabetical Order
es_es: Orden alfabético

source: Alphabetical Order (Private Last)
es_es: Orden alfabético (privados al final)

source: Alphanumeric characters
es_es: Caracteres alfanuméricos

source: Alphanumeric characters plus "_"
es_es: Caracteres alfanuméricos y "_"

source: Alternation
es_es: Alternancia

source: Any character except a newline
es_es: Cualquier carácter excepto un carácter de nueva línea

source: Any decimal digit
es_es: Cualquier dígito decimal

source: Any non-digit
es_es: Cualquier carácter excepto un dígito

source: Any non-whitespace character
es_es: Cualquier carácter excepto un espacio en blanco

source: Any non-word character
es_es: Cualquier carácter excepto un carácter de palabra

source: Any whitespace character
es_es: Cualquier tipo de espacio en blanco

source: Any word character
es_es: Cualquier carácter de palabra

source: Appearance
es_es: Apariencia

source: Appearance Preview
es_es: Vista previa de apariencia

source: Apply one of the quick fixes for the current document
es_es: Aplica una de las correcciones rápidas para el documento actual

source: Arabic
es_es: Árabe

source: Ask for a session name and save the list of files currently opened
es_es: Pregunta un nombre de sesión y guarda la lista de archivos abiertos actualmente

source: Ask if unsaved files should be saved and then exit Padre
es_es: Pregunta al usuario si desea guardar los archivos no guardados y cierra Padre

source: Assign the selected expression to a newly declared variable
es_es: Asigna la expresión seleccionada a una variable recién declarada

source: Attributes
es_es: Atributos

source: Authentication
es_es: Autenticación

source: Author
es_es: Autor

source: Auto detect Perl 6 files
es_es: Detectar automáticamente archivos de Perl 6

source: Auto-Complete
es_es: Autocompletar

source: Auto-fold POD markup when code folding enabled
es_es: Plegado automático de marcas POD si el plegado de código está habilitado

source: Autocomplete always while typing
es_es: Autocompletar al escribir

source: Autocomplete brackets
es_es: Autocompletar llaves

source: Autocomplete new functions in scripts
es_es: Autocompletar funciones nuevas en scripts

source: Autocomplete new methods in packages
es_es: Autocompletar métodos nuevos de paquetes

source: Autocompletion error
es_es: Error de Autocompletar

source: Autoindent
es_es: Sangría automática

source: Automatic indentation style detection
es_es: Detección de estilo de sangría automática

source: Background Tasks are running
es_es: Tareas en segundo plano en ejecución

source: Background Tasks are running with high load
es_es: Tareas en segundo plano en ejecución con mucha carga

source: Backreference to the nth group
es_es: Retrorreferencia al grupo enésimo

source: Backspace
es_es: Retroceso

source: Beginning of line
es_es: Principio de línea

source: Behaviour
es_es: Comportamiento

source: Blue butterfly on a green leaf splash image is based on work by Jerry Charlotte (blackbutterfly)
es_es: La imagen de bienvenida de una mariposa azul sobre una hoja verde es obra de Jerry Charlotte (blackbutterfly)

source: Bookmarks
es_es: Marcadores

source: Boolean
es_es: Booleano

source: Braces Assist
es_es: Ayuda para llaves

source: Bring changes from the repository into the working copy
es_es: Aplicar cambios del repositorio a la copia de trabajo

source: Browse directory of the current document to open one or several files
es_es: Muestra el directorio del documento actual para abrir uno o varios archivos

source: Browse the directory of the installed examples to open one file
es_es: Muestra al usuario el directorio de ejemplos instalados para que elija el archivo que desea abrir

source: Browser: no viewer for %s
es_es: Navegador: no hay visor para %s

source: Builds the current project, then run all tests.
es_es: Genera el proyecto actual y después ejecuta todos los tests.

source: C&urrent Document
es_es: Doc&umento actual

source: CHANGED
es_es: MODIFICADO

source: CPAN Explorer
es_es: Explorador de CPAN

source: Cancel
es_es: Cancelar

source: Cannot find python executable in your PATH
es_es: No se encuentra la ruta del ejecutable de python en la variable de entorno PATH

source: Cannot find ruby executable in your PATH
es_es: No se encuentra la ruta del ejecutable de ruby en la variable de entorno PATH

source: Cannot open a directory: %s
es_es: No se puede abrir el directorio %s

source: Cannot set bookmark in unsaved document
es_es: No se puede establecer un marcador en un documento que no se ha guardado

source: Case &sensitive
es_es: &Distinguir mayúsculas de minúsculas

source: Case-insensitive matching
es_es: No distinguir mayúsculas de minúsculas al buscar

source: Change the current selection to lower case
es_es: Convierte la selección actual a minúsculas

source: Change the current selection to upper case
es_es: Convierte la selección actual a mayúsculas

source: Change the encoding of the current document to the default of the operating system
es_es: Cambia la codificación del documento actual a la predeterminada del sistema operativo

source: Change the encoding of the current document to utf-8
es_es: Cambia la codificación del documento actual a UTF-8

source: Change the end of line character of the current document to that used on Mac Classic
es_es: Cambia el carácter de fin de línea del documento actual por el usado en Mac Classic

source: Change the end of line character of the current document to that used on Unix, Linux, Mac OSX
es_es: Cambia el carácter de fin de línea del documento actual por el usado en Unix, Linux y Mac OS X

source: Change the end of line character of the current document to those used in files on MS Windows
es_es: Cambia el carácter de fin de línea del documento actual por la secuencia usada en los archivos de MS Windows

source: Change variable style
es_es: Cambiar estilo de variable

source: Change variable style from camelCase to Camel_Case
es_es: Cambiar el estilo de variable de camelCase a Camel_Case

source: Change variable style from camelCase to camel_case
es_es: Cambiar el estilo de variable de camelCase a camel_case

source: Change variable style from camel_case to CamelCase
es_es: Cambiar el estilo de variable de camel_case a CamelCase

source: Change variable style from camel_case to camelCase
es_es: Cambiar el estilo de variable de camel_case a camelCase

source: Change variable to &camelCase
es_es: Cambiar variable a &camelCase

source: Change variable to &using_underscores
es_es: Cambiar variable a con_g&uiones

source: Change variable to C&amelCase
es_es: Cambiar variable a C&amelCase

source: Change variable to U&sing_Underscores
es_es: Cambiar variable a Con_&Guiones

source: Character classes
es_es: Clases de caracteres

source: Character position
es_es: Posición del carácter

source: Character set
es_es: Juego de caracteres

source: Characters (including whitespace)
es_es: Caracteres (incluidos espacios)

source: Check Complete
es_es: Comprobación completada

source: Check cancelled
es_es: Comprobación cancelada

source: Check for file updates on disk every (seconds)
es_es: Comprobar si hay actualizaciones de archivos en disco cada (segundos)

source: Check the current file for common beginner errors
es_es: Detecta errores típicos de principiante en el archivo actual

source: Chinese
es_es: Chino

source: Chinese (Simplified)
es_es: Chino (Simplificado)

source: Chinese (Traditional)
es_es: Chino (Tradicional)

source: Choose File
es_es: Elegir archivo

source: Cl&ose Window on Hit
es_es: Cerrar &ventana al encontrar coincidencia

source: Claudio Ramirez
es_es: Claudio Ramírez

source: Clean up file content on saving (for supported document types)
es_es: Limpiar el contenido del archivo al guardar (sólo para tipos de documentos compatibles)

source: Click on the arrow for filter settings
es_es: Haga clic en la flecha para ver la configuración de filtro

source: Close
es_es: Cerrar

source: Close &Files...
es_es: C&errar archivos...

source: Close &all Files
es_es: Cerrar todos los &archivos

source: Close &this Project
es_es: Cerrar es&te proyecto

source: Close Window on &Hit
es_es: Cerrar &ventana al encontrar coincidencia

source: Close all
es_es: Cerrar todos

source: Close all &other Files
es_es: Cerrar l&os demás archivos

source: Close all the files belonging to the current project
es_es: Cierra todos los archivos pertenecientes al proyecto actual

source: Close all the files except the current one
es_es: Cierra todos los archivos excepto el actual

source: Close all the files open in the editor
es_es: Cierra todos los archivos abiertos en el editor

source: Close all the files that do not belong to the current project
es_es: Cierra todos los archivos que no pertenecen al proyecto actual

source: Close current document
es_es: Cierra el documento actual

source: Close current document and remove the file from disk
es_es: Cierra el documento actual y elimina el archivo del disco

source: Close other &Projects
es_es: Cerrar otros &proyectos

source: Close some
es_es: Cerrar algunos

source: Close some files
es_es: Cerrar algunos archivos

source: Close the highest priority panel (usually using ESC key)
es_es: Cerrar el panel de prioridad superior (normalmente con la tecla ESC)

source: Close this window
es_es: Cerrar esta ventana

source: Code Order
es_es: Orden del código

source: Collapse all
es_es: Contraer todo

source: Coloured text in output window (ANSI)
es_es: Texto coloreado en la ventana de resultados (ANSI)

source: Combine scattered POD at the end of the document
es_es: Combina al final del documento el POD distribuido

source: Command
es_es: Comando

source: Command line
es_es: Línea de comandos

source: Comment out selected lines or the current line
es_es: Aplica marcas de comentario a las líneas seleccionadas o a la línea actual

source: Comment out/remove comment for selected lines or the current line
es_es: Aplica o quita marcas de comentario a las líneas seleccionadas o a la línea actual

source: Commit file/directory to repository?
es_es: ¿Desea depositar el archivo o directorio en el repositorio?

source: Confirm
es_es: Confirmar

source: Conflicted
es_es: En conflicto

source: Connecting to FTP server %s...
es_es: Conectándose al servidor FTP %s...

source: Connection to FTP server successful.
es_es: Conexión con el servidor FTP establecida correctamente.

source: Content
es_es: Contenido

source: Content Assist
es_es: Ayuda para contenido

source: Contents of the status bar
es_es: Contenido de la barra de estado

source: Contents of the window title
es_es: Contenido del título de la ventana

source: Control character
es_es: Carácter de control

source: Control characters
es_es: Caracteres de control

source: Convert &Encoding
es_es: Conv&ertir codificación

source: Convert &Line Endings
es_es: Convertir caracteres de fin de &línea

source: Convert all tabs to spaces in the current document
es_es: Convierte todas las tabulaciones en espacios en el documento actual

source: Convert all the spaces to tabs in the current document
es_es: Convierte todos los espacios en tabulaciones en el documento actual

source: Cop&y Specials
es_es: Copiar &especiales

source: Copied
es_es: Copiado

source: Copy
es_es: Copiar

source: Copy &All
es_es: Copi&ar todo

source: Copy &Directory Name
es_es: Copiar nombre de &directorio

source: Copy &Selected
es_es: Copiar &seleccionadas

source: Copy Editor &Content
es_es: &Copiar contenido del editor

source: Copy F&ilename
es_es: Copiar nom&bre de archivo

source: Copy Full &Filename
es_es: Copiar nombre de arc&hivo completo

source: Copy Name
es_es: Copiar nombre

source: Copy Value
es_es: Copiar valor

source: Copy filename to clipboard
es_es: Copiar nombre de archivo al portapapeles
